# ConceptualConstructionMaterial Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ConceptualConstructionMaterial Property
ParameterTypeId Class See Also
---
"Graphical Appearance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ConceptualConstructionMaterial { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConceptualConstructionMaterial As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ConceptualConstructionMaterial {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace